intersectSurfWithCurveNearEnd(Surface!System.Runtime.CompilerServices.IsConst*,GCurve!System.Runtime.CompilerServices.IsConst*,System.Int32,System.Double*,System.Double*)
Intersect a surface and a curve and finds the intersection closes to
a specified end of the curve
Returns ERR_FAILURE if no intersections are found
Input: The surface, the curve and the end.
Outputs:  The parameter on the curve and the location of the intersection
both are optional